### Pandas are cute but its a different type of panda.
* Pandas is a newer package and is built on the top of numpy.Pandas provide an efficient manipulation of Data,when we think of data in real world then we think of tables and Pandas is used to do all the possible opeartions on Tables. 
* The name Pandas is derived from word Panel-Data .The data that is changing with the time.

* <a href="https://www.kaggle.com/singhbirender/storescsv">Link for Data set </a>

## 1. Import The Package

In [2]:
# We have imported Numpy Package because Pandas inherits Numpy and is basically a top layer on Numpy Package.
# we have used alias names "np" for numpy and "pd" for pandas.
import numpy as np
import pandas as pd

In [3]:
pd.__version__

'1.0.5'

### Pandas Objects/Data Structures  
#### We have two types of Data Structure in Pandas
<b>1. Series</b> <br>
* Series we can imagine as a Column of Excel. So it is one-dimensonal,homogeneous array of indexed data.
* Series allow broadcasting.

<b>2. DataFrame</b> <br>
* DataFrame is like a Table(two-dimensional) in Excel that stores heterogeneous data type and they allow broadcasting.
* We can make DataFrame's From Series.

### <b>Series</b>

In [4]:
# Creating a series from basic python Data Structure -List
series_1 = pd.Series([0,1,1,2,3,5,8])

In [5]:
series_1
# here we can see an auto created index for the Series with data type as int64.

0    0
1    1
2    1
3    2
4    3
5    5
6    8
dtype: int64

In [6]:
# in this we stored the first element as float and the data type of Series got changed. Hence Homogeneity.
series_2 = pd.Series((0.0,1,1,2,3,5,8)) #Tuple
series_2

0    0.0
1    1.0
2    1.0
3    2.0
4    3.0
5    5.0
6    8.0
dtype: float64

In [7]:
dict_1 = {'Stu_id':1001, 'Name': 'Albert', 'Dept': 'Computer_Sci', 'Marks': 98}
pd.Series(dict_1)

Stu_id            1001
Name            Albert
Dept      Computer_Sci
Marks               98
dtype: object

In [8]:
# we can control all those values like dtype,index etc.
series_3 = pd.Series(np.random.randint(5,10),
                    index = ['a','b','c','d','e'],
                    dtype = "int64")
series_3

a    8
b    8
c    8
d    8
e    8
dtype: int64

In [9]:
# two important methods
# 1. Series.values
series_1.values

array([0, 1, 1, 2, 3, 5, 8], dtype=int64)

In [10]:
#2 .Series.index
series_1.index

RangeIndex(start=0, stop=7, step=1)

In [11]:
for j in series_1.index:
    print(j)

0
1
2
3
4
5
6

In [12]:
# in zip we get a tuple but the output looks like a dictionary with key and a value
for item in zip(series_1.index,series_1.values):
    print(item)

(0, 0)
(1, 1)
(2, 1)
(3, 2)
(4, 3)
(5, 5)
(6, 8)

### <b>Data Frame</b>

In [13]:
# Creating dataframe from python data structures
list_1 = [1,2,3,45,56]

In [14]:
pd.DataFrame?

In [15]:
df_1 = pd.DataFrame(list_1,columns=["A"])
df_1

    A
0   1
1   2
2   3
3  45
4  56

In [16]:
num_arr = np.random.randint(10,99,(4,2))
num_arr

array([[96, 82],
       [18, 55],
       [92, 98],
       [69, 12]])

In [17]:
# we can provide name to the column and can also give explicit index.
df_1=pd.DataFrame(num_arr,columns=["A","B"],index = [1,2,3,4])

In [18]:
df_1.index

Int64Index([1, 2, 3, 4], dtype='int64')

In [19]:
df_1.columns

Index(['A', 'B'], dtype='object')

In [20]:
dict_1

{'Stu_id': 1001, 'Name': 'Albert', 'Dept': 'Computer_Sci', 'Marks': 98}

In [21]:
d1 = {'Stu_id': [1001, 1008, 1011, 1034],
         'Name': ['Albert', 'Micheal', 'Messi', 'Shawn'],
             'Dept': ['Physics', 'Music', 'Sports', 'Finance'],
                 'Marks': [100, 99, 63, 85]}

In [22]:
pd.DataFrame(d1,index=["A","B","C","D"])

   Stu_id     Name     Dept  Marks
A    1001   Albert  Physics    100
B    1008  Micheal    Music     99
C    1011    Messi   Sports     63
D    1034    Shawn  Finance     85

### How to Access the Data

# To access the data we can use
#[] -- the one we are using in basic python
#.loc[]-- this one will get you data from user defined indexes
#.iloc[] -- this will get you data from default indexes

In [23]:
series_4 = pd.Series([1,2,3,4,5,6,7,8],index=["a","b","c","d","e","f","g","h"])
series_4

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
dtype: int64

In [24]:
# by using [] , in this the index starts from 0 just like in python
series_4[1]

2

In [25]:
series_4[1:4:2]

b    2
d    4
dtype: int64

In [26]:
# by using iloc , same using default index starting from 0
series_4.iloc[1:4] # will get values till n-1

b    2
c    3
d    4
dtype: int64

In [27]:
series_4.iloc[1:4]

b    2
c    3
d    4
dtype: int64

In [28]:
# this uses the user defined index to get the element
series_4.loc["f"]

6

In [29]:
series_4.loc["a":"d"] # will give all the values

a    1
b    2
c    3
d    4
dtype: int64

In [30]:
# we can use [] & .loc for indexing but can't use .iloc
series_4[series_4<5]

a    1
b    2
c    3
d    4
dtype: int64

In [31]:
series_4.loc[series_4<5]

a    1
b    2
c    3
d    4
dtype: int64

In [32]:
# now to read the data from external sources we use pd.read_xxxx, xxxx-refers to the file format i.e, excel,csv ....
stores = pd.read_csv("stores.csv")

In [33]:
# this is the actual data that we need to work on , Dataframe = table with flexible row and colun names 
stores.head() # to get top 5 records by default we use head

,StoreCode,StoreName,StoreType,Location,OperatingCost,Staff_Cnt,TotalSales,Total_Customers,AcqCostPercust,BasketSize,ProfitPercust,OwnStore,OnlinePresence,Tenure,StoreSegment
0,STR101,Electronics Zone,Electronincs,Delhi,21.0,60,160.0,110,3.90,2.620,16.46,0,1,4,4
1,STR102,Apparel Zone,Apparel,Delhi,21.0,60,160.0,110,3.90,2.875,17.02,0,1,4,4
2,STR103,Super Bazar,Super Market,Delhi,22.8,40,108.0,93,3.85,2.320,18.61,1,1,4,1
3,STR104,Super Market,Super Market,Delhi,21.4,60,258.0,110,3.08,3.215,19.44,1,0,3,1
4,STR105,Central Store,Super Market,Delhi,18.7,80,360.0,175,3.15,3.440,17.02,0,0,3,2

In [34]:
# so it has 32 rows starting from 0-31 and 15 columns
stores.shape

(32, 15)

In [35]:
# with [] what we can do is we can give the column name and can get all the values in that column
stores["StoreCode"].head(2)

0    STR101
1    STR102
Name: StoreCode, dtype: object

In [36]:
# we can ge multiple columns by giving column names as a list
stores[["StoreCode","StoreName","StoreType"]].head(2)

  StoreCode         StoreName     StoreType
0    STR101  Electronics Zone  Electronincs
1    STR102      Apparel Zone       Apparel

In [37]:
# get all the column names and rows starting from 1 to n-1
stores[1:4]

,StoreCode,StoreName,StoreType,Location,OperatingCost,Staff_Cnt,TotalSales,Total_Customers,AcqCostPercust,BasketSize,ProfitPercust,OwnStore,OnlinePresence,Tenure,StoreSegment
1,STR102,Apparel Zone,Apparel,Delhi,21.0,60,160.0,110,3.90,2.875,17.02,0,1,4,4
2,STR103,Super Bazar,Super Market,Delhi,22.8,40,108.0,93,3.85,2.320,18.61,1,1,4,1
3,STR104,Super Market,Super Market,Delhi,21.4,60,258.0,110,3.08,3.215,19.44,1,0,3,1

In [38]:
# loc[row,column] we can use user defined
stores.loc[:,"StoreCode"].head(2)

0    STR101
1    STR102
Name: StoreCode, dtype: object

In [39]:
# will give the same resut as above and here it is using default indexes
stores.iloc[:,0].head(2)

0    STR101
1    STR102
Name: StoreCode, dtype: object

In [40]:
stores.StoreCode.head(2)
#df.column_name will give the same results

0    STR101
1    STR102
Name: StoreCode, dtype: object

In [41]:
# multiple column access
stores.loc[:,["StoreCode","TotalSales","Total_Customers"]].head(2)

  StoreCode  TotalSales  Total_Customers
0    STR101       160.0              110
1    STR102       160.0              110

In [42]:
stores.iloc[:,[0,6,7]].head(2)

  StoreCode  TotalSales  Total_Customers
0    STR101       160.0              110
1    STR102       160.0              110

In a nutshell we will be using .loc very frequently in the data science , all the other part was for just understanding.

#### Some more Attributes of data frame

In [43]:
#1 Type of data structure
type(stores)

pandas.core.frame.DataFrame

In [44]:
# No. of dimensions
stores.ndim

2

In [45]:
# size of the data
stores.shape

(32, 15)

In [46]:
# no. of columns
stores.columns

Index(['StoreCode', 'StoreName', 'StoreType', 'Location', 'OperatingCost',
       'Staff_Cnt', 'TotalSales', 'Total_Customers', 'AcqCostPercust',
       'BasketSize', 'ProfitPercust', 'OwnStore', 'OnlinePresence', 'Tenure',
       'StoreSegment'],
      dtype='object')

In [47]:
# data types
stores.dtypes

StoreCode           object
StoreName           object
StoreType           object
Location            object
OperatingCost      float64
Staff_Cnt            int64
TotalSales         float64
Total_Customers      int64
AcqCostPercust     float64
BasketSize         float64
ProfitPercust      float64
OwnStore             int64
OnlinePresence       int64
Tenure               int64
StoreSegment         int64
dtype: object

In [48]:
# missing values , hence we can see we have missing values in AcqCostPercust
stores.count()

StoreCode          32
StoreName          32
StoreType          32
Location           32
OperatingCost      32
Staff_Cnt          32
TotalSales         32
Total_Customers    32
AcqCostPercust     29
BasketSize         32
ProfitPercust      32
OwnStore           32
OnlinePresence     32
Tenure             32
StoreSegment       32
dtype: int64

In [49]:
# some more analysis on the data,i.e,Data Descriptives
stores.describe().T

,count,mean,std,min,25%,50%,75%,max
OperatingCost,32.0,20.090625,6.026948,10.400,15.42500,19.200,22.80,33.900
Staff_Cnt,32.0,61.875000,17.859216,40.000,40.00000,60.000,80.00,80.000
TotalSales,32.0,230.721875,123.938694,71.100,120.82500,196.300,326.00,472.000
Total_Customers,32.0,146.687500,68.562868,52.000,96.50000,123.000,180.00,335.000
AcqCostPercust,29.0,3.651034,0.532664,2.760,3.15000,3.730,3.92,4.930
BasketSize,32.0,3.217250,0.978457,1.513,2.58125,3.325,3.61,5.424
ProfitPercust,32.0,17.848750,1.786943,14.500,16.89250,17.710,18.90,22.900
OwnStore,32.0,0.437500,0.504016,0.000,0.00000,0.000,1.00,1.000
OnlinePresence,32.0,0.406250,0.498991,0.000,0.00000,0.000,1.00,1.000
Tenure,32.0,3.687500,0.737804,3.000,3.00000,4.000,4.00,5.000
StoreSegment,32.0,2.625000,1.211504,1.000,2.00000,2.000,4.00,4.000

#### Creating New Columns

In [50]:
# We can create new conditional columns 
stores.loc[:,"New_column1"] = stores.TotalSales-stores.AcqCostPercust
stores.head(5)

,StoreCode,StoreName,StoreType,Location,OperatingCost,Staff_Cnt,TotalSales,Total_Customers,AcqCostPercust,BasketSize,ProfitPercust,OwnStore,OnlinePresence,Tenure,StoreSegment,New_column1
0,STR101,Electronics Zone,Electronincs,Delhi,21.0,60,160.0,110,3.90,2.620,16.46,0,1,4,4,156.10
1,STR102,Apparel Zone,Apparel,Delhi,21.0,60,160.0,110,3.90,2.875,17.02,0,1,4,4,156.10
2,STR103,Super Bazar,Super Market,Delhi,22.8,40,108.0,93,3.85,2.320,18.61,1,1,4,1,104.15
3,STR104,Super Market,Super Market,Delhi,21.4,60,258.0,110,3.08,3.215,19.44,1,0,3,1,254.92
4,STR105,Central Store,Super Market,Delhi,18.7,80,360.0,175,3.15,3.440,17.02,0,0,3,2,356.85

In [51]:
stores.shape

(32, 16)

In [52]:
#2  assign method (But this method doesn't create any permanent change in the data)
stores.assign(Customer_sales = stores.Total_Customers*stores.AcqCostPercust).head(2)

,StoreCode,StoreName,StoreType,Location,OperatingCost,Staff_Cnt,TotalSales,Total_Customers,AcqCostPercust,BasketSize,ProfitPercust,OwnStore,OnlinePresence,Tenure,StoreSegment,New_column1,Customer_sales
0,STR101,Electronics Zone,Electronincs,Delhi,21.0,60,160.0,110,3.9,2.620,16.46,0,1,4,4,156.1,429.0
1,STR102,Apparel Zone,Apparel,Delhi,21.0,60,160.0,110,3.9,2.875,17.02,0,1,4,4,156.1,429.0

In [53]:
#  this method creates permanent change and is highly recommandable
stores.loc[:,"New_column"] = np.random.randint(40,100,)
stores.shape

(32, 17)

#### Deleting The Columns

In [54]:
stores.drop?
# in this function we are going to use argument Columns

In [55]:
# we can drop the columns using .drop method
stores.drop(columns="New_column1",inplace=True)

In [56]:
stores.head(2)

,StoreCode,StoreName,StoreType,Location,OperatingCost,Staff_Cnt,TotalSales,Total_Customers,AcqCostPercust,BasketSize,ProfitPercust,OwnStore,OnlinePresence,Tenure,StoreSegment,New_column
0,STR101,Electronics Zone,Electronincs,Delhi,21.0,60,160.0,110,3.9,2.620,16.46,0,1,4,4,75
1,STR102,Apparel Zone,Apparel,Delhi,21.0,60,160.0,110,3.9,2.875,17.02,0,1,4,4,75

#### Renaming of the Columns

In [57]:
stores.rename(columns={"Staff_Cnt":"Staff_count","BasketSize":"Basket"}).head(2)
# to make it permanent change we can use argument inplace = True

,StoreCode,StoreName,StoreType,Location,OperatingCost,Staff_count,TotalSales,Total_Customers,AcqCostPercust,Basket,ProfitPercust,OwnStore,OnlinePresence,Tenure,StoreSegment,New_column
0,STR101,Electronics Zone,Electronincs,Delhi,21.0,60,160.0,110,3.9,2.620,16.46,0,1,4,4,75
1,STR102,Apparel Zone,Apparel,Delhi,21.0,60,160.0,110,3.9,2.875,17.02,0,1,4,4,75

#### Basic Data Analysis Steps: 
* Import the data
* Check Type of data (Series/DataFrame)
* Size of data
* Shape/Dimensions of data
* Column's Name,Column's datatype and Column's Count
* Missing Values in Data
* Summary and Descriptives of data<br>

#### Data Manipulation - Structural
* Subsetting [Extracting Few Column's]
* Reordering Of Column's
* Adding New Column's
* Dropping Column's
* Renaming Column's